src/cf/InformationRegisters/НумерацияСпецификацийДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НумерацияСпецификацийДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецификацияКДоговору</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СпецификацияКДоговору</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НумерацияСпецификацийДоговоров/Ext/ManagerModule.bsl
Процедура УстановитьНомерСпецификации(СпецификацияОбъект, Отказ) Экспорт
	
	Если не ЗначениеЗаполнено(СпецификацияОбъект.НомерСпецификации) Тогда // новая спецификация
		
	ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, Отказ);	
	
	Иначе
		
	ИзменитьНомерСпецификации (СпецификацияОбъект, Отказ);
	
	КонецЕсли;

КонецПроцедуры

Процедура ИзменитьНомерСпецификации(СпецификацияОбъект, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НумерацияСпецификацийДоговоров.НомерСпецификации
		|ИЗ
		|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
		|ГДЕ
		|	НумерацияСпецификацийДоговоров.СпецификацияКДоговору = &СпецификацияКДоговору";
	
	Запрос.УстановитьПараметр("СпецификацияКДоговору", СпецификацияОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.НомерСпецификации= СпецификацияОбъект.НомерСпецификации Тогда // номер не менялся
			Возврат; 
	Иначе
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(НумерацияСпецификацийДоговоров.НомерСпецификации) КАК НомерСпецификации
		|ИЗ
		|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
		|ГДЕ
		|	НумерацияСпецификацийДоговоров.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",СпецификацияОбъект.ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НомерСпецификации = ? (ВыборкаДетальныеЗаписи.НомерСпецификации = Null, 0, Число(ВыборкаДетальныеЗаписи.НомерСпецификации));

	
	
КонецПроцедуры
